Repository: matrostik/mytrip.mvc
Catalog: Releases/SRC.mytrip.mvc.1.0.53.1/mtm.Tourism/ToursLanguage.*.resx
Languages: ru_ru

source: Category
ru_ru: Категория

source: Create Category
ru_ru: Создать Категорию

# createsubcategory
source: Create Subcategory from "{0}"
ru_ru: Создать Подкатегорию в "{0}"

# DateTour
source: with {0} on {1}<br/> ({2} days)
ru_ru: с {0} по {1}<br/> ({2} дней)

# editcategory
source: Edit Category "{0}"
ru_ru: Редактировать Категорию "{0}"

# editsubcategory
source: Edit Subcategory "{0}" from "{1}"
ru_ru: Редактировать Подкатегорию "{0}" из "{1}"

source: Hotel
ru_ru: Отель

source: Price
ru_ru: Цена

# priceMin
source: from {0}
ru_ru: от {0}

# Services
source: Additional services
ru_ru: Включенные услуги

source: Subcategory
ru_ru: Подкатегория

source: Add variant
ru_ru: Добавить вариант

# allculture
source: All language?
ru_ru: Для всех языков?

# body
source: Details
ru_ru: Описание

source: Count People
ru_ru: Количество Человек

source: Country
ru_ru: Страна

# createsubcategory1
source: Create Subcategory
ru_ru: Создать Подкатегорию

source: Create Tour
ru_ru: Создать Тур

# DateTour2
source: with {0} on {1}
ru_ru: с {0} по {1}

source: Edit Tour
ru_ru: Редактировать Тур

source: From City
ru_ru: Вылет из Города

source: Image
ru_ru: Изображение

# ordertour
source: Order
ru_ru: Заказать

source: Phone
ru_ru: Телефон

source: Resort
ru_ru: Курорт

source: Search Tour
ru_ru: Поиск Тура

source: Start date
ru_ru: Дата начала

source: Stop date
ru_ru: Дата окончания

source: Title
ru_ru: Название

# Varianty
source: Variant
ru_ru: Вариант

# ordersend
source: Thank you! Your application is accepted.
ru_ru: Спасибо! Ваша заявка принята.

# arhiv
source: Tours arhiv
ru_ru: Архив туров

# createcountry
source: Add Country
ru_ru: Добавить Страну

# editcountry
source: Edit Country "{0}"
ru_ru: Редактировать Страну "{0}"

# categorylist
source: select category
ru_ru: выберите категорию

# countrylist
source: select country
ru_ru: выберите страну

source: from
ru_ru: с

source: to
ru_ru: по

# closeTour
source: How many days before the tour to move it to the archive
ru_ru: За сколько дней до начала тура переносить его в архив

# columnTours
source: Number of columns to the page of tours
ru_ru: Количество столбцов для страницы туров

# MoneyProcent
source: Percentage of cheating if the price is in the in. currency
ru_ru: Процент накрутки если цена указана в ин. валюте

# roleChiefTourManager
source: The role of general manager
ru_ru: Роль главного менеджера

# setting
source: Tours setting
ru_ru: Настройка туров

# styleTours
source: Style show rounds
ru_ru: Стиль показа туров

# unlockTours
source: Include Tours
ru_ru: Включить Туры

# viewDescription
source: Include descriptions show categories and countries
ru_ru: Включить показ описания категорий и стран

# widthImgTours
source: Image Width Tour
ru_ru: Ширина изображения тура

# nameCountry
source: Title of the page
ru_ru: Название страницы стран

# nameOrderTours
source: Title page of orders
ru_ru: Название страницы заказов

# nameTours
source: Title page of tours
ru_ru: Название страницы туров

# roleTourManager
source: Manager's role
ru_ru: Роль менеджера
