Repository: matrostik/mytrip.mvc
Catalog: Main/Source/Mytrip.Store/StoreLanguage.*.resx
Languages: ru_ru

source: Department:
ru_ru: Раздел:

source: Prise:
ru_ru: Цена:

source: Producer:
ru_ru: Производитель:

source: Producers
ru_ru: Производители

source: SubDepartment:
ru_ru: Подраздел:

source: All Department
ru_ru: Все разделы

source: All Producer
ru_ru: Все производители

source: found
ru_ru: найдено

source: Price from:
ru_ru: Цена от:

# Price_to
source: to:
ru_ru: до:

source: results
ru_ru: результатов

source: Search
ru_ru: Поиск

source: for
ru_ru: по

source: date
ru_ru: дате

source: prise
ru_ru: цене

# Sorted
source: Sort by:
ru_ru: Сортировать по:

source: title
ru_ru: названию

source: votes
ru_ru: рейтингу

source: All culture
ru_ru: Для всех языков

source: Body
ru_ru: Описание

source: Create
ru_ru: Создать

# imageDepartment
source: Image for Department
ru_ru: Изображение для Отдела

source: Title Department
ru_ru: Название Отдела

source: Create Department
ru_ru: Создать Отдел

# createSubDepartment
source: Create Subdepartment in Department "{0}"
ru_ru: Создать Суботдел в Отделе "{0}"

# createProducer
source: Add Producer
ru_ru: Добавить Производителя

source: Edit
ru_ru: Редактировать

# editDepartment
source: Edit Department "{0}"
ru_ru: Редактировать Отдел "{0}"

# editProducer
source: Edit Producer "{0}"
ru_ru: Редактировать Производителя "{0}"

# editSubdepartment
source: Edit Subdepartment "{0}" in Department "{1}"
ru_ru: Редактировать Суботдел "{0}" из Отдела "{1}"

# imageProducer
source: Image for Producer
ru_ru: Изображение для Производителя

source: Title Producer
ru_ru: Название Производителя

source: Add
ru_ru: Добавить

# createProduct
source: Add Product
ru_ru: Добавить Продукт

# createSubDepartment2
source: Create Subdepartment
ru_ru: Создать Суботдел

# editProduct
source: Edit Product "{0}"
ru_ru: Редактировать Продукт "{0}"

# imageProduct
source: Image for Product
ru_ru: Изображение для Продукта

source: Title Product
ru_ru: Название Продукта

# _abstract
source: Short description
ru_ru: Oписание

# departmentId
source: Department
ru_ru: Отдел

# producerId
source: Producer
ru_ru: Производитель

# titlePrice
source: Price
ru_ru: Цена

# totalCount
source: Count
ru_ru: Количество

# UrlFile
source: Url file for download
ru_ru: Url файла для загрузки

# viewcount
source: Unlock view count
ru_ru: Включить показ количества

# viewprice
source: Unlock view price
ru_ru: Включить показ цены

# viewvotes
source: Unlock reviews and rating
ru_ru: Включить отзывы и оценки

# compare
source: Check to {0} product
ru_ru: Отметьте продукт для {0}

# compare2
source: compare
ru_ru: сравнения

# nocompare
source: Products not selected for comparison
ru_ru: Продукты для сравнения не выбраны

# nocompare2
source: Choose at least two products for comparison
ru_ru: Выберите не менее двух продуктов для сравнеия

# bodyProduct
source: Details
ru_ru: Детали

source: Buy
ru_ru: Купить

# cart
source: Add to {0}
ru_ru: Добавить в {0}

# cart2
source: cart
ru_ru: корзину

# mycart
source: In {0} of products {1}, amount of {2}
ru_ru: В {0} товаров {1}, на сумму {2}

# mycart2
source: cart
ru_ru: корзине

source: Amount of
ru_ru: На сумму

# mycarttitle
source: My cart
ru_ru: Моя корзина

# foto
source: Images ({0})
ru_ru: Фотографии ({0})

# reviews
source: Reviews ({0})
ru_ru: Отзывы ({0})

# thanks_for_vote
source: Thanks for your vote!
ru_ru: Спасибо что проголосовали!

# you_have_a_voted
source: You have already voted
ru_ru: Вы уже голосовали

# review_body
source: Add your review
ru_ru: Добавьте свой отзыв

# imageProduct1
source: Additional images for Product
ru_ru: Дополнительные изображения для Продукта

source: Packing
ru_ru: Упаковка

source: Free
ru_ru: Бесплатно

source: Address
ru_ru: Адрес

# checkout
source: Сheckout
ru_ru: Оформление

source: First Name
ru_ru: Имя

source: Last Name
ru_ru: Фамилия

source: Phone
ru_ru: Телефон

# ordermanageremail
source: Order from <b>{0}</b><br/>===================================== <br/><b>Client: </b>{1}<br/><b>Date: </b>{2}<br/><b>Order: </b>{3} <br/>===================================== <br/>You receive this mail because you have registered on the site {4} and have subscribed to receive notifications by e-mail .
ru_ru: Заказ от <b>{0}</b><br/>===================================== <br/><b>Заказчик: </b>{1}<br/><b>Дата: </b>{2}<br/><b>Заказ: </b>{3} <br/>===================================== <br/>Вы получили это письмо, т.к зарегистрировались на сайте {4} и подписались на получение уведомлений по e-mail. Внимание! Это письмо сгенерировано автоматически, на него отвечать не надо!

# orderTitle
source: Order
ru_ru: Заказ

# new_orders
source: My orders
ru_ru: Мои заказы

# status_0
source: awaiting registration
ru_ru: ожидает регистрации

# buy_ok
source: <h1>Thank you for your purchase! </h1>In the near future you will be contacted our manager.
ru_ru: <h1>Спасибо за покупку! </h1>В ближайшее время с Вами свяжется наш менеджер.

# logon
source: log in to your account
ru_ru: войти под своей учетной записью

# myorder_anonym
source: To view the status of orders You need to {0} or {1}.
ru_ru: Для просмотра состояния заказов Вам необходимо {0} или {1}.

source: register
ru_ru: зарегистрироватся

source: Delivery:
ru_ru: Доставка:

# status_1
source: awaiting confirmation of payment
ru_ru: ожидает подтверждения оплаты

# status_2
source: paid
ru_ru: оплачено

# status_3
source: paid for and delivered
ru_ru: оплачено и доставлено

source: Total:
ru_ru: Итого:

source: Total delivery:
ru_ru: Итого с доставкой:

# ordernull
source: You do not have orders to watch.
ru_ru: У Вас еще нет заказов для просмотра.

# review_body_edit
source: Edit your review
ru_ru: Редактировать свой отзыв

source: Organization
ru_ru: Организация

source: organizationINN
ru_ru: ИНН организации

source: organizationKPP
ru_ru: КПП организации

# saleView
source: Sale {0}% to {1}
ru_ru: Скидка {0}% до {1}

# manager
source: Manager Store
ru_ru: Управление Магазином

source: Manager Orders
ru_ru: Управление Заказами

# namberCatalog
source: Namber to Catalog Producer
ru_ru: Номер в Каталоге Производителя

# orderdelete
source: User {0} delete order #{1}
ru_ru: Пользователь {0} удалил заказ #{1}

# status_4
source: anonyms
ru_ru: анонимные

# orderdetailstitle
source: Order #{0}
ru_ru: Заказ #{0}

# customer
source: Сustomer
ru_ru: Заказчик

# Delivery1
source: Delivery
ru_ru: Доставка

source: Seller
ru_ru: Продавец

source: Namber Account
ru_ru: Номер Счета

source: Price In Words
ru_ru: Цена прописью

# selleraccountant
source: Accountant
ru_ru: Бухгалтер

# sellerbank
source: Title Bank
ru_ru: Название Банка

# sellerbankaccount
source: Account Bank
ru_ru: Счет Банка

# sellerbankaccountBIK
source: BIK Bank
ru_ru: БИК Банка

# sellerbankaccountSeller
source: Account Seller to Bank
ru_ru: Счет Продавца в Банке

# sellerdirector
source: Director
ru_ru: Директор

# sellerliteNDS
source: Lite NDS?
ru_ru: Упрощенный НДС?

source: Preview
ru_ru: Предпросмотр

# setaccount
source: Bill
ru_ru: Выставить счет

# addaccount
source: add position
ru_ru: добавить позицию

source: print
ru_ru: распечатать

source: Create Sale
ru_ru: Создать Скидку

# dateclose
source: Date Close Sale
ru_ru: Дата закрытия скидки

# datestart
source: Date Start Sale
ru_ru: Дата начала скидки

source: Sale
ru_ru: Скидка

# uploadproductxml
source: Create list of products from file. Xml
ru_ru: Создание списка продуктов из файла .xml

# columnDepartment
source: Column Department and Producer
ru_ru: Столбцы Отделов и Производителей

source: Column Product
ru_ru: Столбцы Продуктов

source: Money Procent
ru_ru: Процент при смене валюты

source: Name Producer
ru_ru: Название Производителей

# NameSearchPage
source: Name Search
ru_ru: Название Поиска

source: Name Store
ru_ru: Название Магазина

source: Online Buy
ru_ru: Продажи онлайн

# organizationBuy
source: Buy for Organization
ru_ru: Продажи для Организаций

source: Role Chief Store Manager
ru_ru: Название роли главного менеджера

source: Role Store Manager
ru_ru: Название роли менеджера

source: Store Setting
ru_ru: Настройка Магазина

# styleDepartment
source: Style Department and Producer
ru_ru: Стиль Отделов и Производителей

source: Style Product
ru_ru: Стиль Продуктов

source: Unlock Store
ru_ru: Включить Магазин

source: View Produkt Table
ru_ru: Отображать продукты кратко таблично

# widthImgDepartment
source: Width Img Department and Producer
ru_ru: Ширина Изображения Отделов и Производителей

source: Width Img Product
ru_ru: Ширина Изображения Продукта

# people
source: Private Person
ru_ru: Частное Лицо

source: Download
ru_ru: Загрузить
