Repository: matrostik/mytrip.mvc
Catalog: Mytrip(.NET Framework 4)/Mytrip.Core/CoreLanguage.*.resx
Languages: ru_ru

source: About
ru_ru: О Сайте

# account_error_captcha
source: Captcha is entered with errors.
ru_ru: В слове для проверки допущена ошибка.

# account_error_password
source: Password are required to be a minimum of {0} characters in length.
ru_ru: Пароль должен состоять не менее чем из {0} знаков.

# account_error_username
source: User name is entered with errors.
ru_ru: В имени пользователя допущена ошибка.

source: Account Information
ru_ru: Информация об аккаунте

# account_max_length_email
source: E-mail are required to be a maximum of 50 characters in length.
ru_ru: E-mail не может превышать 50 знаков.

# account_max_length_password
source: Password are required to be a maximum of 50 characters in length.
ru_ru: Пароль не может превышать 50 знаков.

# account_max_length_username
source: User name are required to be a maximum of 50 characters in length.
ru_ru: Имя пользователя не может превышать 50 знаков.

# account_null_captcha
source: Captcha cannot be null or empty.
ru_ru: Вы не ввели фразу для проверки.

# account_null_email
source: E-mail cannot be null or empty.
ru_ru: Вы не ввели E-mail.

# account_null_password
source: Password cannot be null or empty.
ru_ru: Вы не ввели пароль.

# account_null_username
source: User name cannot be null or empty.
ru_ru: Вы не ввели имя пользователя.

source: Add role
ru_ru: Добавить роль

source: Add User to Role
ru_ru: Добавить пользователя в роль

source: All roles
ru_ru: Все роли

source: All users
ru_ru: Все пользователи

source: Are you sure?
ru_ru: Вы уверены?

source: Back to List
ru_ru: Назад к списку

# bytes
source: Byte
ru_ru: Байта

source: Captcha
ru_ru: Капча

source: Change date
ru_ru: Дата изменения

source: Change Password
ru_ru: Изменить пароль

# change_password_success
source: Your password has been changed successfully.
ru_ru: Ваш пароль успешно изменен.

# change_password_text_first
source: Use the form below to change your password.
ru_ru: Форма для изменения пароля.

# change_password_text_last
source: New passwords are required to be a minimum of {0} characters in length.
ru_ru: Новый пароль должен иметь в длину не менее {0} знаков.

source: Choose new name
ru_ru: Введите новое имя

# choose_role
source: Choose a role
ru_ru: Выберите роль

source: Confirm Password
ru_ru: Повторите пароль

source: Create
ru_ru: Создать

# create_account
source: Create a New Account
ru_ru: Создайте новый Аккаунт

source: Create new folder:
ru_ru: Создать новую папку:

source: Creation Date
ru_ru: Дата создания

# default_provider_error
source: An unknown error occurred. Please verify your entry and try again. If the problem persists, please contact your system administrator.
ru_ru: Произошла неизвестная ошибка. Пожалуйста проверте введенные данные и попытайтесь еще раз. Если ошибка повторится обратитесь к системному администратору.

source: Delete
ru_ru: Удалить

# donate
source: Donate to project
ru_ru: Поддержка проекта

source: Error
ru_ru: Ошибка

# error1
source: Error
ru_ru: Ошибка

# error_text
source: Sorry, an error occurred while processing your request.
ru_ru: Извините, при обработке Вашего запроса произошла ошибка.

# file_dublicate_file
source: File already exists. Please enter a different file.
ru_ru: Файл уже существует. Пожалуйста выберите другой файл.

# file_dublicate_name
source: Name folder already exists. Please enter a different name folder.
ru_ru: Имя папки уже используется. Пожалуйста введите другое имя папки.

# file_manager
source: Files Manager
ru_ru: Файловый менеджер

# file_max_name
source: Name folder are required to be a maximum of 30 characters in length.
ru_ru: Имя папки не должно превышать 30 знаков.

# file_null_file
source: File cannot be null or empty.
ru_ru: Файл не загружен.

# file_null_name
source: Name folder cannot be null or empty.
ru_ru: Вы не ввели имя папки.

source: Home
ru_ru: Главная

source: Is Approved
ru_ru: Одобрен

source: Last Activity Date
ru_ru: Дата последней активности

source: Last Login Date
ru_ru: Дата последнего изменения логина

source: Last Password Changed Date
ru_ru: Дата последнего изменения пароля

source: Log Off
ru_ru: Выход

source: Log On
ru_ru: Вход

# logon_error_password
source: Password is entered with errors.
ru_ru: В пароле допущена ошибка.

# logon_text
source: Please enter your username and password.
ru_ru: Пожалуйста введите имя пользователя и пароль.

source: New Password
ru_ru: Новый пароль

source: Old Password
ru_ru: Старый пароль

source: Password
ru_ru: Пароль

source: Register
ru_ru: Регистрация

# register_duplicate_email
source: A username for that e-mail address already exists. Please enter a different e-mail address.
ru_ru: E-mail уже используется. Пожалуйста введите другой e-mail.

# register_duplicate_username
source: User name already exists. Please enter a different user name.
ru_ru: Имя пользователя недоступно. Пожалуйста введите другое имя пользователя.

# register_error_email
source: The e-mail address provided is invalid. Please check the value and try again.
ru_ru: Формат e-mail несоответствует. Пожалуйста введите другой e-mail.

# register_password_confurmpassword
source: The password and confirmation password do not match.
ru_ru: Формат пароля несоответствует.

# register_text_first
source: Use the form below to create a new account.
ru_ru: Форма для создания нового аккаунта.

# register_text_last
source: Passwords are required to be a minimum of {0} characters in length.
ru_ru: Пароль должен иметь в длину не менее {0} знаков.

source: Remember Me?
ru_ru: Запомнить Меня?

source: Rename
ru_ru: Переименовать

source: Rename file or folder
ru_ru: Переименовать файл или папку

source: Role Name
ru_ru: Имя роли

# rolename_duplicate
source: Role name already exists. Please enter a different role name.
ru_ru: Имя роли уже существует.Пожалуйста введите другое имя роли.

# rolename_max_length
source: Role name are required to be a maximum of 15 characters in length.
ru_ru: Имя роли не может превышать 15 знаков.

# rolename_null
source: Role name cannot be null or empty.
ru_ru: Вы не ввели имя роли.

source: Role Information
ru_ru: Информация о ролях

# role_in_user
source: User already belong to this role. Please choose another one.
ru_ru: Пользователь уже находится в роли. Пожалуйста выберите другую роль.

# role_null
source: Role cannot be null or empty.
ru_ru: Вы не выбрали роль.

# search_max_length
source: Search are required to be a maximum of 50 characters in length.
ru_ru: Слова для поиска не могут превышать 50 знаков.

# search_null
source: Search cannot be null or empty.
ru_ru: Вы не ввели слово для поиска.

source: Search role
ru_ru: Найти роль

source: Search user
ru_ru: Найти пользователя

# select_file_upload
source: Select file for upload.
ru_ru: Выберите файл для загрузки.

source: Size
ru_ru: Размер

source: Theme
ru_ru: Темы

source: Upload
ru_ru: Загрузить

source: Upload file:
ru_ru: Загрузить файл:

source: User Count
ru_ru: Количество пользователей

source: User IP
ru_ru: IP пользователя

source: User Name
ru_ru: Имя пользователя

# user_file
source: Users and Files
ru_ru: Пользователи и Файлы

# user_in_role
source: The user in role
ru_ru: Пользователь в роли

# user_is_approved
source: The user is approved
ru_ru: Пользователь одобрен

# user_is_not_approved
source: The user is not approved
ru_ru: Пользователь неодобрен

# user_manager
source: Users manager
ru_ru: Менеджер пользователей

# Welcome
source: Welcome {0}!
ru_ru: Здравствуйте {0}!

# logon_text1
source: {0} if you don't have an account.
ru_ru: {0} для создания нового аккаунта.

source: My Profile
ru_ru: Мой Профиль
