Repository: matrostik/mytrip.mvc
Catalog: 2.0.251/Mytrip.Mvc.Language/Mytrip_Mvc_Language.*.resx
Languages: ru_ru

source: Add
ru_ru: Добавить

# addedby
source: Has added: {0}
ru_ru: Добавил: {0}

# add_comment
source: Add the comment
ru_ru: Добавить комментарий

# add_home_page
source: To add on the home page?
ru_ru: Добавить на главную страницу?

source: Add tegs
ru_ru: Добавить теги

source: Admin
ru_ru: Админ

# agree
source: I agree
ru_ru: Согласен

# allocate_color
source: To allocate with colour?
ru_ru: Выделить цветом?

# all_tegs_article
source: All tegs (to add teg in article press it):
ru_ru: Все теги (чтобы добавить тег в статью нажмите на него):

# all_tegs_post
source: All tegs (to add teg in post press it):
ru_ru: Все теги (чтобы добавить тег в пост нажмите на него):

source: article:
ru_ru: статья:

# article1
source: Article
ru_ru: Статья

# article_comment
source: To resolve comments?
ru_ru: Разрешить комментарии?

# article_comments
source: comments: {0}
ru_ru: комментариев: {0}

# article_heading
source: heading:
ru_ru: рубрика:

# article_only_registr
source: Only for the registered?
ru_ru: Только для зарегистрированных?

# article_rating
source: rating: {0}
ru_ru: рейтинг: {0}

# article_subheading
source: subheading:
ru_ru: подрубрика:

# article_tegs
source: tegs:
ru_ru: теги:

# article_views
source: views: {0}
ru_ru: просмотров: {0}

# Artycles_valid_100_simbols
source: The article should contain not less than 100 symbols.
ru_ru: Статья должна содержать не менее 100 символов.

# Artycles_valid_applet
source: The article cannot contain: applet
ru_ru: Статья не может содержать: applet

# Artycles_valid_baks
source: The article cannot contain: $
ru_ru: Статья не может содержать: $

# Artycles_valid_embed
source: The article cannot contain: embed
ru_ru: Статья не может содержать: embed

# Artycles_valid_object
source: The article cannot contain: object
ru_ru: Статья не может содержать: object

# Artycles_valid_procent
source: The article cannot contain: <%%>
ru_ru: Статья не может содержать: <%%>

# Artycles_valid_script
source: The article cannot contain: script
ru_ru: Статья не может содержать: script

# artycle_editor
source: Article editor
ru_ru: Журналист

# artycle_votes
source: To resolve voting?
ru_ru: Разрешить голосование?

source: Back
ru_ru: Назад

source: Blogger
ru_ru: Блоггер

source: blog heading:
ru_ru: рубрика блога:

# blog_posts
source: posts: {0}
ru_ru: постов: {0}

source: Byte
ru_ru: Байт

source: Change date
ru_ru: Дата изменения

# change_password_text
source: Your password has been changed successfully.
ru_ru: Ваш пароль изменен.

source: Chief editor
ru_ru: Главный редактор

# chose_heding
source: Choose a heading
ru_ru: Выберите рубрику

# comment_valid_1000_simbol
source: The comment should contain no more than 1000 symbols.
ru_ru: Комментарий должен содержать не более 1000 символов.

# comment_valid_2_simbol
source: The comment should contain not less than 2 symbols.
ru_ru: Комментарий должен содержать не менее 2 символов.

# comment_valid_applet
source: The comment cannot contain: applet
ru_ru: Комментарий не может содержать: applet

# comment_valid_baks
source: The comment cannot contain: $
ru_ru: Комментарий не может содержать: $

# comment_valid_embed
source: The comment cannot contain: embed
ru_ru: Комментарий не может содержать: embed

# comment_valid_object
source: The comment cannot contain: object
ru_ru: Комментарий не может содержать: object

# comment_valid_procent
source: The comment cannot contain: <%%>
ru_ru: Комментарий не может содержать: <%%>

# comment_valid_script
source: The comment cannot contain: script
ru_ru: Комментарий не может содержать: script

source: Confirm password
ru_ru: Повторите пароль

source: Content
ru_ru: Контент

# Copyright
source: Mytrip.Mvc Copyright © 2009 - 2010 Oleg Stuhin
ru_ru: Mytrip.Mvc Copyright © 2009 - 2010 Олег Стюхин

# count_comment
source: Which it is necessary to write quantity of comments to the user for activation of its blog (comments are considered on one per every day):
ru_ru: Количество комментариев которые необходимо написать пользователю для активации его блога (комментарии учитываются по одному за каждый день):

source: Create
ru_ru: Создать

source: Create folder
ru_ru: Создать папку

source: Create teg
ru_ru: Создать тег

# date_close
source: Closing date
ru_ru: Дата закрытия

# delete
source: Remove
ru_ru: Удалить

# delete_article
source: You are assured that wish to remove article?
ru_ru: Вы уверены что хотите удалить статью?

# delete_blog
source: You are assured that wish to remove a blog?
ru_ru: Вы уверены что хотите удалить блог?

# delete_comment
source: You are assured that wish to remove a comment?
ru_ru: Вы уверены что хотите удалить комментарий?

# delete_file
source: You are assured that wish to remove a file?
ru_ru: Вы уверены что хотите удалить файл?

# delete_folder
source: You are assured that wish to remove a folder?
ru_ru: Вы уверены что хотите удалить папку?

# delete_heading
source: You are assured that wish to remove a heading?
ru_ru: Вы уверены что хотите удалить рубрику?

# delete_news
source: You are assured that wish to remove news?
ru_ru: Вы уверены что хотите удалить новость?

# delete_post
source: You are assured that wish to remove a post?
ru_ru: Вы уверены что хотите удалить пост?

# delete_user
source: You are assured that wish to remove a user?
ru_ru: Вы уверены что хотите удалить пользователя?

# Description_valid_3_simbols
source: The summary should contain not less than 3 symbols.
ru_ru: Краткое содержание должно содержать не менее 3 символов.

# Description_valid_4000_simbols
source: The summary should contain no more than 4000 symbols.
ru_ru: Краткое содержание должно содержать не более 4000 символов.

# Description_valid_applet
source: The summary cannot contain: applet
ru_ru: Краткое содержание не может содержать: applet

# Description_valid_baks
source: The summary cannot contain: $
ru_ru: Краткое содержание не может содержать: $

# Description_valid_embed
source: The summary cannot contain: embed
ru_ru: Краткое содержание не может содержать: embed

# Description_valid_object
source: The summary cannot contain: object
ru_ru: Краткое содержание не может содержать: object

# Description_valid_procent
source: The summary cannot contain: <%%>
ru_ru: Краткое содержание не может содержать: <%%>

# Description_valid_script
source: The summary cannot contain: script
ru_ru: Краткое содержание не может содержать: script

source: Domain name
ru_ru: Имя домена

# domain_name_text
source: The domain name is displayed in title pages and registers in return address RSS if the domain name is entered incorrectly return references RSS will to work incorrectly (http://not to enter):
ru_ru: Доменное имя отображается в title страницы и прописывается в обратный адрес RSS, если доменное имя введено неправильно обратные ссылки RSS будут работать неправильно (http:// не вводить):

source: edit
ru_ru: правка

source: Edit teg
ru_ru: Редактировать тег

source: Email setting
ru_ru: Настройка email

# email_setting1
source: Adjustment Email for sending of letters from a site
ru_ru: Настройка Email для отправки писем с сайта

source: Error!
ru_ru: Ошибка!
