Repository: matrostik/mytrip.mvc
Catalog: 2.0.251/Mytrip.Mvc.Language/Mytrip_Mvc_Language.*.resx
Languages: ru_ru

# hi_user
source: Hello
ru_ru: Привет

# image_valid_256_simbols
source: The reference should contain no more than 256 symbols.
ru_ru: Ссылка должна содержать не более 256 символов.

# image_valid_applet
source: The reference cannot contain: applet
ru_ru: Ссылка не может содержать: applet

# image_valid_baks
source: The reference cannot contain: $
ru_ru: Ссылка не может содержать: $

# image_valid_embed
source: The reference cannot contain: embed
ru_ru: Ссылка не может содержать: embed

# image_valid_null
source: In the absence of the reference insert null.
ru_ru: При отсутствии ссылки вставьте null.

# image_valid_object
source: The reference cannot contain: object
ru_ru: Ссылка не может содержать: object

# image_valid_procent
source: The reference cannot contain: <%%>
ru_ru: Ссылка не может содержать: <%%>

# image_valid_script
source: The reference cannot contain: script
ru_ru: Ссылка не может содержать: script

# include_articles
source: To include articles? (Are by default included)
ru_ru: Включить статьи? (по умолчанию включены)

# include_blogs
source: To include blogs? (Are by default included)
ru_ru: Включить блоги? (по умолчанию включены)

# include_captcha
source: To include CAPTCHA? It (is by default included)
ru_ru: Включить CAPTCHA? (по умолчанию включена)

# include_email
source: To include acknowledgement of the user on Email? (At inclusion you will pass to adjustment page email)
ru_ru: Включить подтверждение пользователя по Email? (при включении Вы перейдете на страницу настройки email)

# include_email1
source: To include acknowledgement of the user on Email? (At inclusion in the control panel there will be a reference for adjustment email)
ru_ru: Включить подтверждение пользователя по Email? (при включении в панели управления появится ссылка для настройки email)

# include_news
source: To include news? (Are by default included)
ru_ru: Включить новости? (по умолчанию включены)

# lang_setting
source: Choose language by default for a site
ru_ru: Выберите язык по умолчанию для сайта

# last_visit
source: Last visiting: {0}
ru_ru: Последнее посещение: {0}

# licence
source: The licence agreement
ru_ru: Лицензионное соглашение

# logon_register
source: registration
ru_ru: регистрацией

# logon_text
source: If you do not have account on a site {0} take advantage of
ru_ru: Если у Вас нет аккаунта на сайте {0} воспользуйтесь

# menu_artycles
source: Articles
ru_ru: Статьи

# menu_blogs
source: Blogs
ru_ru: Блоги

# menu_change_password
source: Change Password
ru_ru: Сменить пароль

# menu_create_blog_theme
source: Create a blog theme
ru_ru: Создать рубрику блога

# menu_edit_article
source: Edit article
ru_ru: Редактировать статью

# menu_edit_blog
source: Edit a blog
ru_ru: Редактировать блог

# menu_edit_comment
source: Edit the comment
ru_ru: Редактировать комментарий

# menu_edit_news
source: Edit news
ru_ru: Редактировать новость

# menu_edit_post
source: Edit a post
ru_ru: Редактировать пост

# menu_file_manager
source: File manager
ru_ru: Файловый менеджер

# menu_home
source: Home
ru_ru: Главная

# menu_logoff
source: Sign Out
ru_ru: Выход

# menu_logon
source: Sign In
ru_ru: Вход

# menu_management_users
source: Management of users
ru_ru: Управление пользователями

# menu_news
source: News
ru_ru: Новости

# menu_register
source: Register
ru_ru: Регистрация

# menu_search
source: Search
ru_ru: Поиск

# menu_site_adjustment
source: Site setting
ru_ru: Настройка сайта

# menu_tegs
source: Tegs
ru_ru: Теги

# menu_write_article
source: Write article
ru_ru: Написать статью

# menu_write_news
source: Write news
ru_ru: Написать новость

# menu_write_post
source: Write a post
ru_ru: Написать пост

source: news:
ru_ru: новость:

source: news heading:
ru_ru: рубрика новостей:

source: New password
ru_ru: Новый пароль

source: Next
ru_ru: Далее

source: Old password
ru_ru: Старый пароль

# only_for_registered
source: [ only for the registered ]
ru_ru: [ только для зарегистрированных ]

# pager_count
source: quantity on page
ru_ru: количество на странице

# pager_pages
source: pages
ru_ru: страницы

source: Password
ru_ru: Пароль

# photo_article
source: Url a photo to the article
ru_ru: Url фото к статье

# photo_article_summary
source: Photo to the summary as a photo to article?
ru_ru: Фото к краткому содержанию как фото к статье?

# photo_summary
source: Url a photo to the summary
ru_ru: Url фото к краткому содержанию

source: post:
ru_ru: пост:

# post_blog
source: blog:
ru_ru: блог:

# register_text
source: Passwords are required to be a minimum of {0} characters in length.
ru_ru: Длина пароля должна иметь не менее {0} знаков.

# reg_admin
source: Registration of the admin of a site
ru_ru: Регистрация администратора сайта

# reg_users
source: Registration of users
ru_ru: Регистрация пользователей

source: Remember me?
ru_ru: Запомнить?

# results_search
source: Results of search
ru_ru: Результаты поиска

# right_activation_blog
source: Before activation of your blog remains comments: {0} <small>(comments written to one day are not considered)</small>
ru_ru: До активации Вашего блога осталось комментариев: {0} <small>(комментарии написанные в один день не учитываются)</small>

# right_control_panel
source: Control panel
ru_ru: Панель управления

# right_create_blog
source: Create a blog
ru_ru: Создать блог

# right_menu_user
source: Menu
ru_ru: Меню

# roles_site
source: Site roles (to add a role to the user press it):
ru_ru: Роли сайта (чтобы добавить роль пользователю нажмите на нее):

# roles_user
source: Roles of the user (to remove a role press it):
ru_ru: Роли пользователя (чтобы удалить роль нажмите на нее):

source: Save
ru_ru: Сохранить

# search_users
source: Search in the User Name or Email:
ru_ru: Поиск по Логину или Email:

source: Size
ru_ru: Размер

source: Summary
ru_ru: Краткое содержание

# tegs_article
source: Tegs articles (to remove teg from article press it):
ru_ru: Теги статьи (чтобы удалить тег из статьи нажмите на него):

# tegs_post
source: Tegs a post (to remove teg from a post press it):
ru_ru: Теги поста (чтобы удалить тег из поста нажмите на него):

source: Title
ru_ru: Название

# title_valid_256_simbols
source: The title should contain no more than 256 symbols.
ru_ru: Название должно содержать не более 256 символов.

# title_valid_3_simbols
source: The title should contain not less than 3 symbols.
ru_ru: Название должно содержать не менее 3 символов.

# title_valid_applet
source: The title cannot contain: applet
ru_ru: Название не может содержать: applet

# title_valid_baks
source: The title cannot contain: $
ru_ru: Название не может содержать: $

# title_valid_embed
source: The title cannot contain: embed
ru_ru: Название не может содержать: embed

# title_valid_object
source: The title cannot contain: object
ru_ru: Название не может содержать: object

# title_valid_procent
source: The title cannot contain: <%%>
ru_ru: Название не может содержать: <%%>

# title_valid_script
source: The title cannot contain: script
ru_ru: Название не может содержать: script

# total_registered
source: In total it is registered: {0}
ru_ru: Всего зарегистрировано: {0}

source: Upload
ru_ru: Загрузить

source: Upload file
ru_ru: Загрузить файл

source: User Name
ru_ru: Логин

source: Users
ru_ru: Пользователи

# user_online
source: Online: {0}
ru_ru: Сейчас на сайте: {0}

source: Verifying phrase
ru_ru: Проверочная фраза

# create_blog_text
source: (blog)
ru_ru: (блог)

# delete_teg
source: You are assured that wish to remove teg?
ru_ru: Вы уверены что хотите удалить тег?

# display_lang
source: To display the language panel?
ru_ru: Отоброжать языковую панель?

# email_approved
source: Registration Confirmation via email
ru_ru: Подтверждение регистрации по email

# email_approved_text1
source: In the email you specified during registration sent a letter. You must confirm registration by clicking on the link in the letter.
ru_ru: На email указанный Вами при регистрации выслано письмо. Вам необходимо подтвердить регистрацию перейдя по ссылке в письме.

# email_approved_text2
source: Thank you for registering on the site
ru_ru: Спасибо за регистрацию на сайте

# email_appr_post_body1
source: Hello! You are receiving this letter because
ru_ru: Здравствуйте! Вы получили это письмо т.к. на сайте

# email_appr_post_body2
source: the user was registrated on our site with you email. If this registration was made by you, please confirm it by clicking on the link
ru_ru: была произведена регистрация пользователя с Вашим email. Если эту регистрацию произвели Вы то Вам необходимо подтвердить её перейдя по ссылке

# email_appr_post_body3
source: Site Administration
ru_ru: Администрация сайта

# email_appr_post_title
source: Register online
ru_ru: Регистрация на сайте

source: Folders
ru_ru: Папки

# menu_create_heading_article
source: Create heading articles
ru_ru: Создать рубрику статей

# menu_create_heading_news
source: Create heading articles
ru_ru: Создать рубрику новостей

# menu_create_subheading_article
source: Create a subheding under the heading of articles
ru_ru: Создать подрубрику в рубрике статей

# menu_create_subheading_news
source: Create a subheding under the heading of news
ru_ru: Создать подрубрику в рубрике новостей

# menu_edit_heading_article
source: Edit heading articles
ru_ru: Редактировать рубрику статей

# menu_edit_heading_news
source: Edit heading news
ru_ru: Редактировать рубрику новостей

# menu_edit_heding_blog
source: Edit heading blog
ru_ru: Редактировать рубрику блога

# menu_edit_subheading_article
source: Edit subheding in the heading of articles
ru_ru: Редактировать подрубрику в рубрике статей

# menu_edit_subheading_news
source: Edit subheding in the heading of news
ru_ru: Редактировать подрубрику в рубрике новостей

source: Port
ru_ru: Порт

# smtp
source: Outgoing mail server (smtp)
ru_ru: Сервер исходящей почты (smtp)

# Ssl
source: Ssl On?
ru_ru: Включить Ssl?

# view_all_culture
source: Show for all languages?
ru_ru: Отображать для всех языков?
