Repository: matrostik/mytrip.mvc
Catalog: 2.0.251/Mytrip.Mvc.Language/Mytrip_Mvc_Language.*.resx
Languages: ru_ru

# GPLv2
source: GNU General Public License version 2 (GPLv2) Copyright (C) 1989, 1991 Free Software Foundation, Inc. 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed. Preamble The licenses for most software are designed to take away your freedom to share and change it. By contrast, the GNU General Public License is intended to guarantee your freedom to share and change free software--to make sure the software is free for all its users. This General Public License applies to most of the Free Software Foundation's software and to any other program whose authors commit to using it. (Some other Free Software Foundation software is covered by the GNU Library General Public License instead.) You can apply it to your programs, too. When we speak of free software, we are referring to freedom, not price. Our General Public Licenses are designed to make sure that you have the freedom to distribute copies of free software (and charge for this service if you wish), that you receive source code or can get it if you want it, that you can change the software or use pieces of it in new free programs; and that you know you can do these things. To protect your rights, we need to make restrictions that forbid anyone to deny you these rights or to ask you to surrender the rights. These restrictions translate to certain responsibilities for you if you distribute copies of the software, or if you modify it. For example, if you distribute copies of such a program, whether gratis or for a fee, you must give the recipients all the rights that you have. You must make sure that they, too, receive or can get the source code. And you must show them these terms so they know their rights. We protect your rights with two steps: (1) copyright the software, and (2) offer you this license which gives you legal permission to copy, distribute and/or modify the software. Also, for each author's protection and ours, we want to make certain that everyone understands that there is no warranty for this free software. If the software is modified by someone else and passed on, we want its recipients to know that what they have is not the original, so that any problems introduced by others will not reflect on the original authors' reputations. Finally, any free program is threatened constantly by software patents. We wish to avoid the danger that redistributors of a free program will individually obtain patent licenses, in effect making the program proprietary. To prevent this, we have made it clear that any patent must be licensed for everyone's free use or not licensed at all. The precise terms and conditions for copying, distribution and modification follow. TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION 0. This License applies to any program or other work which contains a notice placed by the copyright holder saying it may be distributed under the terms of this General Public License. The "Program", below, refers to any such program or work, and a "work based on the Program" means either the Program or any derivative work under copyright law: that is to say, a work containing the Program or a portion of it, either verbatim or with modifications and/or translated into another language. (Hereinafter, translation is included without limitation in the term "modification".) Each licensee is addressed as "you". Activities other than copying, distribution and modification are not covered by this License; they are outside its scope. The act of running the Program is not restricted, and the output from the Program is covered only if its contents constitute a work based on the Program (independent of having been made by running the Program). Whether that is true depends on what the Program does. 1. You may copy and distribute verbatim copies of the Program's source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program. You may charge a fee for the physical act of transferring a copy, and you may at your option offer warranty protection in exchange for a fee. 2. You may modify your copy or copies of the Program or any portion of it, thus forming a work based on the Program, and copy and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions: a) You must cause the modified files to carry prominent notices stating that you changed the files and the date of any change. b) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License. c) If the modified program normally reads commands interactively when run, you must cause it, when started running for such interactive use in the most ordinary way, to print or display an announcement including an appropriate copyright notice and a notice that there is no warranty (or else, saying that you provide a warranty) and that users may redistribute the program under these conditions, and telling the user how to view a copy of this License. (Exception: if the Program itself is interactive but does not normally print such an announcement, your work based on the Program is not required to print an announcement.) These requirements apply to the modified work as a whole. If identifiable sections of that work are not derived from the Program, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works. But when you distribute the same sections as part of a whole which is a work based on the Program, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it. Thus, it is not the intent of this section to claim rights or contest your rights to work written entirely by you; rather, the intent is to exercise the right to control the distribution of derivative or collective works based on the Program. In addition, mere aggregation of another work not based on the Program with the Program (or with a work based on the Program) on a volume of a storage or distribution medium does not bring the other work under the scope of this License. 3. You may copy and distribute the Program (or a work based on it, under Section 2) in object code or executable form under the terms of Sections 1 and 2 above provided that you also do one of the following: a) Accompany it with the complete corresponding machine-readable source code, which must be distributed under the terms of Sections 1 and 2 above on a medium customarily used for software interchange; or, b) Accompany it with a written offer, valid for at least three years, to give any third party, for a charge no more than your cost of physically performing source distribution, a complete machine-readable copy of the corresponding source code, to be distributed under the terms of Sections 1 and 2 above on a medium customarily used for software interchange; or, c) Accompany it with the information you received as to the offer to distribute corresponding source code. (This alternative is allowed only for noncommercial distribution and only if you received the program in object code or executable form with such an offer, in accord with Subsection b above.) The source code for a work means the preferred form of the work for making modifications to it. For an executable work, complete source code means all the source code for all modules it contains, plus any associated interface definition files, plus the scripts used to control compilation and installation of the executable. However, as a special exception, the source code distributed need not include anything that is normally distributed (in either source or binary form) with the major components (compiler, kernel, and so on) of the operating system on which the executable runs, unless that component itself accompanies the executable. If distribution of executable or object code is made by offering access to copy from a designated place, then offering equivalent access to copy the source code from the same place counts as distribution of the source code, even though third parties are not compelled to copy the source along with the object code. 4. You may not copy, modify, sublicense, or distribute the Program except as expressly provided under this License. Any attempt otherwise to copy, modify, sublicense or distribute the Program is void, and will automatically terminate your rights under this License. However, parties who have received copies, or rights, from you under this License will not have their licenses terminated so long as such parties remain in full compliance. 5. You are not required to accept this License, since you have not signed it. However, nothing else grants you permission to modify or distribute the Program or its derivative works. These actions are prohibited by law if you do not accept this License. Therefore, by modifying or distributing the Program (or any work based on the Program), you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or modifying the Program or works based on it. 6. Each time you redistribute the Program (or any work based on the Program), the recipient automatically receives a license from the original licensor to copy, distribute or modify the Program subject to these terms and conditions. You may not impose any further restrictions on the recipients' exercise of the rights granted herein. You are not responsible for enforcing compliance by third parties to this License. 7. If, as a consequence of a court judgment or allegation of patent infringement or for any other reason (not limited to patent issues), conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License. If you cannot distribute so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not distribute the Program at all. For example, if a patent license would not permit royalty-free redistribution of the Program by all those who receive copies directly or indirectly through you, then the only way you could satisfy both it and this License would be to refrain entirely from distribution of the Program. If any portion of this section is held invalid or unenforceable under any particular circumstance, the balance of the section is intended to apply and the section as a whole is intended to apply in other circumstances. It is not the purpose of this section to induce you to infringe any patents or other property right claims or to contest validity of any such claims; this section has the sole purpose of protecting the integrity of the free software distribution system, which is implemented by public license practices. Many people have made generous contributions to the wide range of software distributed through that system in reliance on consistent application of that system; it is up to the author/donor to decide if he or she is willing to distribute software through any other system and a licensee cannot impose that choice. This section is intended to make thoroughly clear what is believed to be a consequence of the rest of this License. 8. If the distribution and/or use of the Program is restricted in certain countries either by patents or by copyrighted interfaces, the original copyright holder who places the Program under this License may add an explicit geographical distribution limitation excluding those countries, so that distribution is permitted only in or among countries not thus excluded. In such case, this License incorporates the limitation as if written in the body of this License. 9. The Free Software Foundation may publish revised and/or new versions of the General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns. Each version is given a distinguishing version number. If the Program specifies a version number of this License which applies to it and "any later version", you have the option of following the terms and conditions either of that version or of any later version published by the Free Software Foundation. If the Program does not specify a version number of this License, you may choose any version ever published by the Free Software Foundation. 10. If you wish to incorporate parts of the Program into other free programs whose distribution conditions are different, write to the author to ask for permission. For software which is copyrighted by the Free Software Foundation, write to the Free Software Foundation; we sometimes make exceptions for this. Our decision will be guided by the two goals of preserving the free status of all derivatives of our free software and of promoting the sharing and reuse of software generally. NO WARRANTY 11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION. 12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
ru_ru: ГЕНЕРАЛЬНАЯ ОБЩЕСТВЕННАЯ ЛИЦЕНЗИЯ GNU Версия 2, Июнь 1991 Авторские права (с) 1989, 1991 Free Software Foundation, Inc. 675 Mass Ave, Кембридж, MA 02139, США Авторские права на перевод: (с) 2000 Общество защиты прав пользователей ПО ( http://consumer.nm.ru) (с) 2000 Сергей Середа ( serge_sereda@hotmail.com) Всем позволяется копировать и распространять дословные копии этого лицензионного документа, но его изменение запрещено. Вводные замечания Лицензии для большинства программных продуктов (ППр) разработаны таким образом, чтобы лишить вас свободы изменять ППр и делиться им с другими. Генеральная Общественная Лицензия GNU, напротив, предназначена гарантировать вам свободу разделять и модифицировать свободные ППр, чтобы обеспечить уверенность, что ППр свободны для всех их пользователей. Эта Генеральная Общественная Лицензия применима к большинству ППр, распространяемых Фондом Свободного Программного Обеспечения (Free Software Foundation), и к любому другому ППр, чьи авторы захотят ее использовать. (Некоторые ППр Фонда Свободного ПО распространяются, вместо этого, под действием Библиотечной Генеральной Общественной Лицензии.) Вы тоже можете применить ее к своим программам. Говоря о свободном ПО, мы имеем в виду свободу, а не цену. Наша Генеральная Общественная Лицензия была разработана, чтобы обеспечить уверенность в том, что у вас есть свобода распространять копии свободного ПО (и брать плату за эту услугу, если хотите), что вы получили исходный код ППр или можете его получить, если пожелаете, что вы вправе модифицировать ППр или использовать его части в новых свободных программах; и что вам известно о наличии у вас прав на это. Для защиты ваших прав, нам необходимо предусмотреть ограничения, которые бы запретили любому отказать вам в ваших правах или потребовать вас отказаться от них. Эти ограничения выражаются в определенных обязанностях, накладываемых на вас, если вы распространяете копии ППр или вносите в него изменения. Например, если вы распространяете копии такой программы, вне зависимости от того, бесплатно или за деньги, вы обязаны предоставить получателям все права, которыми обладаете вы сами. Вы обязаны убедиться, что и они тоже, получили или могут получить исходный код. А так же вы обязаны довести до их сведения эти положения, чтобы они знали о своих правах. Мы защищаем ваши права в два этапа: (1) защищаем авторские права на ПО, и (2) предоставляем вам эту лицензию, дающую вам законное разрешение копировать, распространять и/или вносить изменения в ППр. Так же, для защиты автора и нашей защиты, мы хотим удостовериться, что все понимают, что на свободное ПО нет никаких гарантий. Если ППр был изменен кем-то другим и распространен далее, мы хотим, чтобы его получатели знали, что то, что они получили, не является оригиналом, таким образом, любые проблемы, вызванные третьими лицами, не отразятся на репутации автора оригинального ППр. Наконец, любая свободная программа постоянно подвергается угрозе со стороны патентов на ПО. Мы хотели бы избежать опасности, что кто-то из распространителей свободной программы в индивидуальном порядке получит патентные права с целью сделать программу своей собственностью. Для предотвращения этого мы ясно дали понять, что любой патент должен предусматривать свободное его использование всеми либо не регистрироваться вообще. Ниже приведены точные права и обязанности при копировании, распространении и модификации. Генеральная Общественная Лицензия GNU Права и Обязанности при Копировании, Распространении и Модификации 0. Эта Лицензия распространяется на любую компьютерную программу или иную работу, содержащую помещенное владельцем авторских прав уведомление, гласящее, что эта работа должна распространяться в соответствии с условиями Генеральной Общественной Лицензии. “Программа”, ниже, относится к любой программе или работе, а так же “работе, основанной на Программе”, и означает либо Программу либо любую производную работу в рамках законодательства об авторских правах: то есть работу, содержащую Программу или ее часть, в исходном виде или с изменениями и/или переведенную на другой язык. (Здесь и далее, перевод, без ограничений, включен в термин “модификация”.) Каждый лицензиат адресуется как “Вы”. Деятельность, отличная от копирования, распространения и модификации, не охватывается данной Лицензией; эта деятельность находится вне зоны ее действия. Акт запуска Программы на выполнение не является запрещенным, а результаты работы Программы попадают под действие Лицензии, только если их содержимое составляет работу, основанную на Программе (вне зависимости, была ли она выполнена путем запуска Программы). Правомочность этого положения зависит от функциональной направленности Программы. 1. Вы вправе копировать и распространять неизмененные копии исходного текста Программы, такими, какими вы их получили, на любом носителе и по любым каналам, при условии, что вы открыто и соответствующим образом опубликуете в каждой копии соответствующее заявление об авторских правах и отрицание гарантийных обязательств; оставите без изменений все заявления, относящиеся к данной Лицензии и к отсутствию гарантий; и предоставите всем получателям Программы вместе с самой Программой и копию данной Лицензии. Вы вправе брать плату за акт физической передачи копии, вы вправе также, по вашему желанию, предоставить гарантийные обязательства в обмен на плату. 2. Вы вправе модифицировать вашу копию или копии Программы или любую ее часть, тем самым создавая работу, основанную на Программе, а так же копировать и распространять эти изменения или работу в соответствии с условиями Параграфа 1 выше, при условии, что вы выполните все нижеприведенные требования: а. Вы обязаны обеспечить, чтобы измененные файлы содержали уведомление, гласящее, что вы изменили эти файлы, с датой изменения. б. Вы обязаны обеспечить, чтобы любая работа, распространяемая или публикуемая вами, целиком или частично содержащая или являющаяся производной от Программы или любой ее части, целиком бесплатно лицензировалась для всех третьих сторон, в соответствии с условиями данной Лицензии. в. Если измененная вами программа при работе обычно считывает команды в режиме диалога, вы обязаны сделать так, чтобы при стандартном запуске на выполнение для такого интерактивного использования, программа выводила на печать или на экран сообщение, включающее соответствующее заявление об авторских правах и заявление об отсутствии гарантии (либо гласящее, что вы предоставляете гарантию) и о том, что пользователи могут далее распространять программу, выполняя данные условия, а так же, объясняющее пользователю, как можно просмотреть копию данной Лицензии. (Исключение: если сама Программа интерактивна, но обычно не выводит такого сообщения, от вашей работы, основанной на Программе, не требуется вывод этого сообщения.) Эти требования относятся ко всей модифицированной работе. Если идентифицируемые участки этой работы не являются производными от Программы, и могут сами резонно рассматриваться как независимые и отдельные работы, тогда эта Лицензия и ее положения не применимы к этим участкам, в случае когда вы распространяете их как отдельные работы. Но когда вы распространяете эти же участки работы как части целого, являющегося работой, основанной на Программе, распространение этого целого должно соответствовать положениям данной Лицензии, по которой права других лицензиатов распространяются на все целое, независимо от того, кто его написал. Таким образом, цель данной статьи состоит не в том, чтобы заявить свои права или оспорить ваши права на работу, написанную целиком вами; скорее, целью является обеспечить право контролировать распространение производных или коллективных работ, основанных на Программе. В дополнение, простое совмещение другой работы, не основанной на Программе, с Программой (или работой, основанной на Программе) на носителе информации или в среде передачи данных не помещает другую работу под действие данной Лицензии. 3. Вы вправе копировать и распространять Программу (или работу, основанную на ней, в соответствии со Статьей 2) в виде объектного или исполняемого кода в соответствии с условиями Статей 1 и 2, обеспечив соблюдение одного из нижеследующих условий: а. Сопроводить ее полным соответствующим машиночитаемым исходным кодом, который должен распространяться в соответствии с условиями Статей 1 и 2 на произвольном носителе/канале передачи данных, используемом для обмена программами; или б. Сопроводить ее письменным предложением, имеющим силу, как минимум, в течение трех лет, предоставить любой третьей стороне за плату, не превышающую ваших затрат на физическое распространение исходного текста, полную машиночитаемую копию соответствующего исходного кода, который должен распространяться в соответствии с условиями Статей 1 и 2 на произвольном носителе/канале передачи данных, используемом для обмена программами; или в. Сопроводить ее информацией, полученной вами в качестве предложения предоставить соответствующий исходный код. (Этот вариант разрешен только при некоммерческом распространении и только, если вы получили программу в форме объектного или исполняемого кода вместе с подобным предложением, в соответствии с Подпунктом б) выше.) Исходный код работы означает форму работы, предпочтительную для внесения в нее изменений. Для работы в форме исполняемого кода полный исходный код означает весь исходный код для всех содержащихся в работе модулей, плюс все относящиеся к ней файлы определения интерфейса, плюс сценарии, используемые для контроля компиляции и установки исполняемого файла. Однако, в качестве особого исключения, распространяемый исходный код не должен включать ничего, что обычно распространяется (в форме исходного или исполняемого кода) с главными компонентами (компилятор, ядро и т.п.) операционной системы, в которой запускается исполняемый модуль, если только этот компонент сам не является сопровождающим для исполняемого модуля. Если распространение объектного или исполняемого кода выполняется путем предоставления доступа на копирование из определенного места, тогда предоставление эквивалентного доступа для копирования исходного кода считается распространением исходного кода, даже когда третьим лицам не предлагается скопировать его вместе с объектным кодом. 4. Вы не имеете права копировать, модифицировать, сублицензировать или распространять Программу в любых случаях, кроме тех когда вы это делаете в строгом соответствии с данной Лицензией. В любом другом случае попытка скопировать, модифицировать, сублицензировать или распространить Программу является запрещенной и автоматически лишает вас прав, предусмотренных данной Лицензией. Однако, стороны, получившие от вас, в рамках данной Лицензии, копии или права, сохранят свои лицензии, пока эти стороны будут действовать в полном соответствии с этой Лицензией. 5. От вас не требуется признавать данную Лицензию, так как вы ее не подписывали. Однако, ничто иное не дает вам права модифицировать или распространять Программу или производные от нее работы. Эти действия запрещены законом, в случае если вы не признаете данную Лицензию. Таким образом, модифицируя или распространяя Программу (или любую работу, основанную на Программе), вы высказываете ваше согласие с данной Лицензией на эти виды деятельности, а так же со всеми требованиями и условиями для копирования, распространения или модификации Программы или основанных на ней работ. 6. Каждый раз, когда вы распространяете Программу (или любую работу, основанную на Программе), получатель автоматически получает лицензию на копирование, распространение или модификацию Программы от исходного лицензиара, в соответствии с приведенными условиями. Вы не вправе накладывать какие-либо дополнительные ограничения на реализацию предоставляемых здесь прав получателя. Вы не несете ответственности за обеспечение соблюдения этой Лицензии третьими лицами. 7. Если, в результате судебного разбирательства или заявления о нарушении патента или по любой другой причине (не только связанной с делами о патентах), на вас наложены ограничения (по судебному решению либо по соглашению или в другом случае), противоречащие условиям данной Лицензии, они не освобождают вас от условий данной Лицензии. Если вы не способны распространять Программу таким образом, чтобы одновременно выполнять ваши обязательства по данной Лицензии и любые другие относящиеся к делу обязательства, то следовательно вы не в праве распространять Программу вообще. Например, если патентное соглашение не разрешает бесплатное распространение Программы всем, кто прямо или косвенно получит от вас копии, тогда единственным способом одновременно выполнить как это условие, так и условия данной Лицензии будет полностью воздержаться от распространения Программы. Если любая часть этой статьи в каких-либо определенных обстоятельствах будет считаться недействительной или не имеющей силу, то применима будет остальная часть статьи, а в других обстоятельствах применима вся статья в целом. Целью данной статьи не является склонить вас нарушить какие-либо заявления о патентных или других правах собственности или оспорить какие-либо такие заявления; единственной целью этой статьи является защита целостности системы распространения свободного ПО, которая осуществляется при помощи практики общественных лицензий. Многие люди внесли щедрые вклады в широкий ряд ППр, распространяемых при помощи данной системы в надежде на последовательное применении этой системы; это зависит от автора/дарителя - решать, желает ли он или она распространять ПО при помощи любой другой системы, и лицензиат не может повлиять на этот выбор. Эта статья предназначена предельно ясно показать, что считается наиболее важным в остальной части данной Лицензии. 8. Если распространение и/или использование Программы в некоторых странах ограничено патентами или интерфейсами, защищенными авторскими правами, оригинальный владелец авторских прав, помещающий Программу под данную Лицензию вправе добавить точное географическое ограничение распространения, исключающее эти страны, таким образом, что распространение разрешено только внутри или между странами, оставшимися не исключенными. В таком случае, данная Лицензия будет включать в себя это ограничение, так как будто оно было записано в тексте данной Лицензии. 9. Фонд Свободного ПО может время от времени публиковать пересмотренные и/или новые версии Генеральной Общественной Лицензии. Такие версии будут близки по духу существующей версии, но могут отличаться деталями, учитывающими новые проблемы или интересы. Каждой версии присваивается отдельный номер версии. Если в Программе указан номер версии данной Лицензии и "любая последующая версия", распространяющаяся на нее, у вас есть выбор следовать условиям данной версии или любой последующей версии, опубликованной Фондом Свободного ПО. Если в Программе не указан номер версии данной Лицензии, вы можете выбрать любую версию, когда-либо опубликованную Фондом Свободного ПО. 10. Если вы хотите включить части Программы в другие свободные программы с иными условиями их распространения, напишите автору просьбу о разрешении. Для ПО, авторские права на которое принадлежат Фонду Свободного ПО, напишите в Фонд Свободного ПО; иногда мы делаем для этого исключения. Наше решение будет определяться двумя целями по сохранению свободного статуса всех производных от нашего свободного ПО и продвижению разделения и повторного использования ПО. ОТСУТСТВИЕ ГАРАНТИЙНЫХ ОБЯЗАТЕЛЬСТВ 11. ТАК КАК ПРОГРАММА ЛИЦЕНЗИРУЕТСЯ БЕСПЛАТНО, НА ПРОГРАММУ НЕТ ГАРАНТИИ В СТЕПЕНИ, РАЗРЕШЕННОЙ СООТВЕТСВУЮЩИМ ЗАКОНОМ. ЗА ИСКЛЮЧЕНИЕМ СЛУЧАЕВ, КОГДА В ПИСЬМЕННОМ ВИДЕ СКАЗАНО ИНОЕ, ОБЛАДАТЕЛИ АВТОРСКИХ ПРАВ И/ИЛИ ДРУГИЕ СТОРОНЫ ПРЕДОСТАВЛЯЮТ ПРОГРАММУ "КАК ЕСТЬ" БЕЗ ГАРАНТИЙНЫХ ОБЯЗАТЕЛЬСТВ ЛЮБОГО ВИДА, ЯВНЫХ ИЛИ КОСВЕННЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ТОЛЬКО ИМИ, КОСВЕННЫЕ ГАРАНТИЙНЫЕ ОБЯЗАТЕЛЬСТВА, СВЯЗАННЫЕ С ПОТРЕБИТЕЛЬСКИМИ СВОЙСТВАМИ И ПРИГОДНОСТЬЮ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ. ВЕСЬ РИСК, СВЯЗАННЫЙ КАК С КАЧЕСТВОМ, ТАК И С ПРОИЗВОДИТЕЛЬНОСТЬЮ ПРОГРАММЫ, ЛЕЖИТ НА ВАС. ЕСЛИ БУДЕТ ДОКАЗАНО, ЧТО В ПРОГРАММЕ ЕСТЬ ДЕФЕКТЫ, ВЫ ПРИМЕТЕ НА СЕБЯ РАСХОДЫ ПО ВСЕМУ НЕОБХОДИМОМУ ОБСЛУЖИВАНИЮ, РЕМОНТУ ИЛИ ИСПРАВЛЕНИЮ. 12. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ, КРОМЕ ТРЕБУЕМЫХ ПО СООТВЕТСВУЮЩЕМУ ЗАКОНУ ИЛИ ОГОВОРЕННЫХ В ПИСЬМЕННОЙ ФОРМЕ, НИ ОДИН ИЗ ОБЛАДАТЕЛЕЙ АВТОРСКИХ ПРАВ И НИ ОДНА ДРУГАЯ СТОРОНА, ИМЕЮЩАЯ ПРАВО ИЗМЕНЯТЬ И/ИЛИ РАСПРОСТРАНЯТЬ ПРОГРАММУ, КАК ЭТО РАЗРЕШЕНО ВЫШЕ, НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ПЕРЕД ВАМИ ЗА УЩЕРБ, ВКЛЮЧАЯ ЛЮБОЙ ОБЩИЙ, СПЕЦИФИЧЕСКИЙ, СЛУЧАЙНЫЙ ИЛИ ЛОГИЧЕСКИ ВЫТЕКАЮЩИЙ УЩЕРБ, ПОНЕСЕННЫЙ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ИЛИ НЕВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ ПРОГРАММЫ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ТОЛЬКО ИМИ, ПОТЕРЮ ДАННЫХ ИЛИ НЕТОЧНОСТЬ ОБРАБОТКИ ДАННЫХ ИЛИ ПОТЕРИ, ПОНЕСЕННЫЕ ВАМИ ИЛИ ТРЕТЬИМИ ЛИЦАМИ, ИЛИ НЕСПОСОБНОСТЬ ПРОГРАММЫ РАБОТАТЬ С ЛЮБЫМИ ДРУГИМИ ПРОГРАММАМИ), ДАЖЕ ЕСЛИ ЭТОТ ОБЛАДАТЕЛЬ АВТОРСКИХ ПРАВ БЫЛ ИНФОРМИРОВАН О ВОЗМОЖНОСТИ НАНЕСЕНИЯ ТАКОГО УЩЕРБА. ОКОНЧАНИЕ ОПИСАНИЯ ПРАВ И ОБЯЗАННОСТЕЙ Приложение: Как Применить Эти Условия к Вашим Новым Программам Если вы разрабатываете новую программу и хотите, чтобы она принесла максимально возможную пользу людям, лучшим способом этого достигнуть будет сделать ее свободным ППр, который каждый мог бы распространять или изменять в соответствии с данными условиями. Чтобы это сделать, добавьте к программе следующие уведомления. Надежнее всего добавить их в начало каждого файла с исходным кодом, чтобы наиболее эффективно сообщить об исключении гарантийных обязательств; и каждый файл должен содержать как минимум строку с сообщением об авторских правах и указание, где находится полное уведомление. <одна строка с указанием названия программы и кратким описанием ее назначения.> Авторские права 19гг <имя автора> Эта программа является свободным программным продуктом; вы вправе распространять и/или изменять ее в соответствии с условиями Генеральной Общественной Лицензии GNU в том виде, как она была опубликована Фондом Свободного ПО; либо версии 2 Лицензии либо (по вашему желанию) любой более поздней версии. Программа распространяется в надежде, что она будет полезной, но БЕЗ КАКИХ БЫ ТО НИ БЫЛО ГАРАНТИЙНЫХ ОБЯЗАТЕЛЬСТВ; даже без косвенных гарантийных обязательств, связанных с ПОТРЕБИТЕЛЬСКИМИ СВОЙСТВАМИ и ПРИГОДНОСТЬЮ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ. Для подробностей смотрите Генеральную Общественную Лицензию GNU. Вы должны были получить копию Генеральной Общественной Лицензии GNU вместе с этой программой; если это не так, напишите в Фонд Свободного ПО (Free Software Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA). Так же добавьте информацию о том как с вами можно связаться по электронной или обычной почте. Если программа работает в диалоговом режиме, сделайте так, чтобы при старте в диалоговом режиме она выводила короткое уведомление, вроде этого: Гномовижн, версия 69, Авторские права 19гг имя автора Гномовижн поставляется АБСОЛЮТНО БЕЗ ГАРАНТИЙНЫХ ОБЯЗАТЕЛЬСТВ; для получения подробностей введите "show w". Это - свободный программный продукт и вам позволено распространять его при определенных условиях; для получения подробностей введите "show c". Гипотетические команды "show w" и "show c" должны выводить соответствующие части Генеральной Общественной Лицензии GNU. Разумеется, используемые вами команды могут называться как-то иначе чем "show w" и "show c"; они даже могут быть щелчками мыши или пунктами меню - всем, что подходит для вашей программы. Так же нужно, чтобы ваш наниматель (если вы работаете программистом) или ваше учебное заведение, если есть, при необходимости, подписало "отказ от авторских прав" на программу. Вот пример, измените имена: Йойодайн, Инк., настоящим отказывается от всех интересов, связанных с авторскими правами на программу "Гномовижн" (которая работает с компиляторами), написанную Джеймсом Хакером. <подпись Тай Куна>, 1 апреля 1989 Тай Кун, Президент Данная Генеральная Общественная Лицензия GNU не позволяет включать вашу программу в программы, являющиеся частной собственностью. Если ваша программа является библиотекой подпрограмм, вы можете посчитать более удобным разрешить частным прикладным программам производить компоновку с данной библиотекой. Если это - то, что вы хотите сделать, используйте вместо данной Лицензии Библиотечную Генеральную Общественную Лицензию GNU.
